[
    {
        "Standard ID": "7.G.A.1",
        "Standard description": "Solve problems involving scale drawings of geometric figures, including computing actual lengths and areas from a scale drawing and reproducing a scale drawing at a different scale.",
        "Skill": [
            {
                "name": "Identify scale copies",
                "description": "Differentiate between scaled and non-scaled copies of a figure.",
                "source": "Khan Academy Content - Identify scale copies, EngageNY - Lesson 1",
                "relationship": "Exact match"
            },
            {
                "name": "Explore scale copies",
                "description": "Understand the concept of scale copies and how they relate to original figures.",
                "source": "Khan Academy Content - Explore scale copies",
                "relationship": "Exact match"
            },
            {
                "name": "Corresponding sides and points in scale drawings",
                "description": "Identify corresponding sides, angles, and points between a figure and its scale copy.",
                "source": "Khan Academy Content - Corresponding sides and points, EngageNY - Lesson 2",
                "relationship": "Exact match"
            },
            {
                "name": "Identify scale factor in scale drawings",
                "description": "Determine the scale factor between a figure and its scaled copy.",
                "source": "Khan Academy Content - Identify scale factor in scale drawings, EngageNY - Lesson 2",
                "relationship": "Exact match"
            },
            {
                "name": "Interpret scale factor in scale drawings",
                "description": "Explain how scale factors affect the size of a scaled copy and how scaling can be reversed.",
                "source": "Khan Academy Content - Interpret scale factor in scale drawings, EngageNY - Lesson 5",
                "relationship": "Exact match"
            },
            {
                "name": "Construct scale drawings given a scale factor",
                "description": "Draw a scaled copy of a given figure using a specified scale factor.",
                "source": "Khan Academy Content - Construct scale drawings, EngageNY - Lesson 3",
                "relationship": "Exact match"
            },
            {
                "name": "Solve problems involving scale drawings: finding actual lengths",
                "description": "Use a scale drawing and its given scale to calculate actual distances or lengths of objects.",
                "source": "IXL Content - Scale drawings: word problems, EngageNY - Lesson 7",
                "relationship": "Superset of IXL's 'Scale drawings: word problems', Subset of EngageNY's 'Lesson 7'"
            },
            {
                "name": "Determine the scale of a drawing",
                "description": "Determine the scale of a scale drawing based on actual object dimensions and drawing dimensions.",
                "source": "EngageNY - Lesson 9",
                "relationship": "Exact match"
            },
            {
                "name": "Reproduce a scale drawing at a different scale",
                "description": "Reproduce a given scale drawing at a new, specified scale.",
                "source": "EngageNY - Lesson 10",
                "relationship": "Exact match"
            },
            {
                "name": "Relate scale drawings to area",
                "description": "Explain how the area of a scaled copy is related to the original area and the scale factor.",
                "source": "Khan Academy Content - Relate scale drawings to area, IXL Content - Perimeter and area: changes in scale, EngageNY - Lesson 6 (Optional)",
                "relationship": "Exact match"
            },
            {
                "name": "Solve problems involving scale drawings: word problems with scale factors",
                "description": "Solve word problems that require applying the concept of scale factor to find unknown lengths or dimensions.",
                "source": "IXL Content - Scale drawings: scale factor word problems",
                "relationship": "Exact match"
            },
            {
                "name": "Use different scales to describe drawings",
                "description": "Understand and apply different types of scales (with or without units) to describe and work with scale drawings.",
                "source": "EngageNY - Lesson 12",
                "relationship": "Exact match"
            }
        ]
    },
    {
        "Standard ID": "7.G.A.2",
        "Standard description": "Draw (freehand, with ruler and protractor, and with technology) geometric shapes with given conditions. Focus on constructing triangles from three measures of angles or sides, noticing when the conditions determine a unique triangle, more than one triangle, or no triangle.",
        "Skill": [
            {
                "name": "Classify triangles by sides and angles",
                "description": "Recall and apply classifications of triangles based on side lengths (equilateral, isosceles, scalene) and angle measures (acute, right, obtuse).",
                "source": "IXL Content - Classify triangles",
                "relationship": "Exact match"
            },
            {
                "name": "Triangle side length rules (Triangle Inequality Theorem)",
                "description": "Determine if three given side lengths can form a triangle by applying the Triangle Inequality Theorem.",
                "source": "Khan Academy Content - Triangle side length rules, IXL Content - Triangle inequality",
                "relationship": "Exact match"
            },
            {
                "name": "Ordering triangle sides and angles",
                "description": "Understand and apply the relationship between the lengths of sides and the measures of angles in a triangle (e.g., the longest side is opposite the largest angle).",
                "source": "Khan Academy Content - Ordering triangle sides and angles",
                "relationship": "Exact match"
            },
            {
                "name": "Constructing triangles with given conditions (sides)",
                "description": "Draw triangles using a ruler and protractor when given specific side lengths, and identify if a unique triangle, multiple triangles, or no triangle can be formed.",
                "source": "Khan Academy Content - Constructing triangles",
                "relationship": "Subset"
            },
            {
                "name": "Constructing triangles with given conditions (angles)",
                "description": "Draw triangles using a ruler and protractor when given specific angle measures, and identify if a unique triangle, multiple triangles, or no triangle can be formed.",
                "source": "Khan Academy Content - Constructing triangles",
                "relationship": "Subset"
            },
            {
                "name": "Constructing triangles with given conditions (sides and angles)",
                "description": "Draw triangles using a ruler and protractor when given a combination of side lengths and angle measures, and identify if a unique triangle, multiple triangles, or no triangle can be formed.",
                "source": "Khan Academy Content - Constructing triangles",
                "relationship": "Subset"
            }
        ]
    },
    {
        "Standard ID": "7.G.A.3",
        "Standard description": "Describe the two-dimensional figures that result from slicing three-dimensional figures, as in plane sections of right rectangular prisms and right rectangular pyramids.",
        "Skill": [
            {
                "name": "Identify bases of three-dimensional figures",
                "description": "Recognize and identify the base(s) of various three-dimensional figures, such as prisms and pyramids.",
                "source": "IXL Content - Bases of three-dimensional figures",
                "relationship": "Exact match"
            },
            {
                "name": "Cross sections of 3D objects (basic)",
                "description": "Describe the two-dimensional shapes that result from slicing right rectangular prisms and right rectangular pyramids with a plane (horizontal, vertical, and diagonal slices).",
                "source": "Khan Academy Content - Cross sections of 3D objects (basic), IXL Content - Cross sections of three-dimensional figures",
                "relationship": "Exact match"
            }
        ]
    },
    {
        "Standard ID": "7.G.B.4",
        "Standard description": "Know the formulas for the area and circumference of a circle and use them to solve problems; give an informal derivation of the relationship between the circumference and area of a circle.",
        "Skill": [
            {
                "name": "Identify parts of a circle (radius and diameter)",
                "description": "Identify and define the radius, diameter, and center of a circle, and understand their relationship.",
                "source": "Khan Academy Content - Radius and diameter, IXL Content - Parts of a circle, EngageNY - Lesson 2",
                "relationship": "Exact match"
            },
            {
                "name": "Explore the relationship between circumference and diameter (informal derivation of pi)",
                "description": "Investigate and understand the proportional relationship between the diameter and circumference of circles, leading to an informal derivation of pi.",
                "source": "EngageNY - Lesson 3",
                "relationship": "Exact match"
            },
            {
                "name": "Calculate circumference of a circle",
                "description": "Apply the formula for the circumference of a circle ($C = \\pi d$ or $C = 2\\pi r$) to solve problems.",
                "source": "Khan Academy Content - Circumference of a circle, IXL Content - Circumference of circles, EngageNY - Lesson 4",
                "relationship": "Exact match"
            },
            {
                "name": "Calculate circumference of parts of circles (semicircles, quarter circles)",
                "description": "Calculate the circumference of semicircles and quarter circles.",
                "source": "Khan Academy Content - Circumference of parts of circles, IXL Content - Semicircles: calculate area, perimeter, radius, and diameter, IXL Content - Quarter circles: calculate area, perimeter, and radius",
                "relationship": "Exact match"
            },
            {
                "name": "Solve problems involving circumference and rotations",
                "description": "Use the radius or diameter of a circular object (like a wheel) to determine the distance it travels in a given number of rotations.",
                "source": "Khan Academy Content - Circumference and rotations, EngageNY - Lesson 5 (Optional)",
                "relationship": "Exact match"
            },
            {
                "name": "Estimate the area of a circle",
                "description": "Estimate the area of a circle using informal methods, such as approximating it with a square.",
                "source": "EngageNY - Lesson 7",
                "relationship": "Exact match"
            },
            {
                "name": "Informal derivation of the area of a circle formula",
                "description": "Explain the relationship between the area and circumference of a circle and informally derive the formula for the area of a circle ($A = \\pi r^2$).",
                "source": "EngageNY - Lesson 8",
                "relationship": "Exact match"
            },
            {
                "name": "Calculate area of a circle",
                "description": "Apply the formula for the area of a circle ($A = \\pi r^2$) to solve problems.",
                "source": "Khan Academy Content - Area of a circle, IXL Content - Area of circles, EngageNY - Lesson 8",
                "relationship": "Exact match"
            },
            {
                "name": "Calculate area of parts of circles (semicircles, quarter circles)",
                "description": "Calculate the area of semicircles and quarter circles.",
                "source": "Khan Academy Content - Area of parts of circles, IXL Content - Area of semicircles and quarter circles",
                "relationship": "Exact match"
            },
            {
                "name": "Solve real-world problems involving area and circumference of circles",
                "description": "Determine whether circumference or area is more appropriate for solving various real-world problems involving circles.",
                "source": "Khan Academy Content - Area and circumference of circles challenge, IXL Content - Circles: word problems, EngageNY - Lesson 10",
                "relationship": "Superset"
            },
            {
                "name": "Calculate area of compound figures involving circles",
                "description": "Calculate the area of complex shapes that include fractions of circles or multiple circular components.",
                "source": "Khan Academy Content - Area of parts of circles, EngageNY - Lesson 9, IXL Content - Area of compound figures with triangles, semicircles, and quarter circles",
                "relationship": "Exact match (combines concepts)"
            }
        ]
    },
    {
        "Standard ID": "7.G.B.5",
        "Standard description": "Use facts about supplementary, complementary, vertical, and adjacent angles in a multi-step problem to write and solve simple equations for an unknown angle in a figure.",
        "Skill": [
            {
                "name": "Identify angle relationships (complementary, supplementary, vertical, adjacent)",
                "description": "Identify and define complementary, supplementary, vertical, and adjacent angles in various geometric figures.",
                "source": "Khan Academy Content - Identifying supplementary, complementary, and vertical angles, IXL Content - Identify complementary, supplementary, vertical, and adjacent angles, EngageNY - Lesson 2, Lesson 3",
                "relationship": "Exact match"
            },
            {
                "name": "Find measures of complementary and supplementary angles",
                "description": "Calculate unknown angle measures using the definitions of complementary and supplementary angles (angles adding to 90° or 180°).",
                "source": "Khan Academy Content - Complementary and supplementary angles (visual), IXL Content - Find measures of complementary, supplementary, vertical, and adjacent angles, EngageNY - Lesson 2",
                "relationship": "Exact match"
            },
            {
                "name": "Determine unknown angles using complementary and supplementary relationships (no visual)",
                "description": "Calculate the measure of a complementary or supplementary angle when given the measure of its partner angle, without visual aids.",
                "source": "Khan Academy Content - Complementary and supplementary angles (no visual); IXL Content - Find measures of complementary, supplementary, vertical, and adjacent angles",
                "relationship": "Exact match"
            },
            {
                "name": "Determine unknown angles using vertical angle relationships",
                "description": "Find the measure of an unknown angle when given its vertical angle.",
                "source": "Khan Academy Content - Vertical angles; IXL Content - Find measures of complementary, supplementary, vertical, and adjacent angles",
                "relationship": "Exact match"
            },
            {
                "name": "Write and solve simple equations for unknown angles",
                "description": "Write and solve one-step and multi-step algebraic equations to find unknown angle measures based on relationships like complementary, supplementary, vertical, and adjacent angles.",
                "source": "Khan Academy Content - Unknown angle problems (with algebra), IXL Content - Write and solve equations using angle relationships, EngageNY - Lesson 5",
                "relationship": "Exact match"
            },
            {
                "name": "Solve multi-step problems with angle relationships",
                "description": "Solve multi-step problems involving various angle relationships (complementary, supplementary, vertical, and adjacent) to find unknown angles in complex figures.",
                "source": "Khan Academy Content - Finding missing angles, EngageNY - Lesson 4",
                "relationship": "Exact match"
            },
            {
                "name": "Write and solve simple equations for unknown angles in figures",
                "description": "Set up and solve one-step or two-step algebraic equations to find unknown angle measures using the relationships between supplementary, complementary, vertical, and adjacent angles.",
                "source": "Khan Academy Content - Create equations to solve for missing angles, Unknown angle problems (with algebra); IXL Content - Write and solve equations using angle relationships; EngageNY Lessons - Angle Relationships, Lesson 5",
                "relationship": "Exact match"
            },
            {
                "name": "Solve multi-step problems involving angle relationships",
                "description": "Apply knowledge of complementary, supplementary, vertical, and adjacent angles in multi-step problems to find unknown angle measures.",
                "source": "Khan Academy Content - Finding angle measures between intersecting lines, Finding missing angles; EngageNY Lessons - Angle Relationships, Lesson 4",
                "relationship": "Superset"
            }
        ]
    },
    {
        "Standard ID": "7.G.B.6",
        "Standard description": "Solve real-world and mathematical problems involving area, volume and surface area of two- and three-dimensional objects composed of triangles, quadrilaterals, polygons, cubes, and right prisms.",
        "Skill": [
            {
                "name": "Find the area of triangles and quadrilaterals (review)",
                "description": "Review and apply formulas for the area of common two-dimensional shapes, including triangles, rectangles, parallelograms, and trapezoids.",
                "source": "IXL Content - Area of triangles and trapezoids, IXL Content - Area of rectangles and parallelograms",
                "relationship": "Review/Prerequisite"
            },
            {
                "name": "Calculate the surface area of cubes and right prisms using nets",
                "description": "Find the surface area of cubes and right prisms by visualizing or creating their nets and summing the areas of all faces.",
                "source": "IXL Content - Surface area of cubes and prisms; EngageNY Lessons - Solid Geometry, Lesson 14",
                "relationship": "Exact match"
            },
            {
                "name": "Find the area of composite two-dimensional figures",
                "description": "Calculate the area of complex two-dimensional figures by decomposing them into simpler shapes like triangles, quadrilaterals, and parts of circles.",
                "source": "Khan Academy Content - Shaded areas, IXL Content - Area of compound figures made of rectangles, IXL Content - Area of compound figures with triangles, IXL Content - Area of compound figures with triangles, semicircles, and quarter circles",
                "relationship": "Exact match"
            },
            {
                "name": "Find the volume of right prisms",
                "description": "Calculate the volume of right prisms (including cubes and rectangular prisms) using the formula $V = Bh$, where B is the area of the base.",
                "source": "IXL Content - Volume of cubes and prisms, EngageNY - Lesson 12",
                "relationship": "Exact match"
            },
            {
                "name": "Find the volume of prisms with non-rectangular bases",
                "description": "Determine the volume of prisms with bases that are other polygons (e.g., triangular prisms) by decomposing them into simpler shapes or applying $V=Bh$.",
                "source": "IXL Content - Volume of prisms: advanced, EngageNY - Lesson 13",
                "relationship": "Exact match"
            },
            {
                "name": "Find the surface area of cubes and right prisms",
                "description": "Calculate the surface area of cubes and right prisms using nets or formulas.",
                "source": "IXL Content - Surface area of cubes and prisms, EngageNY - Lesson 14",
                "relationship": "Exact match"
            },
            {
                "name": "Solve real-world problems involving area and volume of 2D and 3D objects",
                "description": "Solve real-world and mathematical problems that require calculating areas and volumes of two- and three-dimensional objects composed of various shapes.",
                "source": "Khan Academy Content - Volume and surface area word problems, IXL Content - Volume of cubes and rectangular prisms: word problems",
                "relationship": "Exact match"
            },
            {
                "name": "Solve real-world problems involving surface area of 3D objects",
                "description": "Solve real-world problems that require calculating the surface area of three-dimensional objects, including cubes and right prisms, considering material costs or wrapping.",
                "source": "Khan Academy Content - Volume and surface area word problems, EngageNY - Lesson 15, Lesson 16",
                "relationship": "Superset"
            },
            {
                "name": "Determine when to use area, volume, or surface area in problem solving",
                "description": "Differentiate between scenarios where area, volume, or surface area is the appropriate measure to solve a real-world problem.",
                "source": "EngageNY - Lesson 15",
                "relationship": "Exact match"
            }
        ]
    },
    {
        "Standard ID": "7.RP.A.1",
        "Standard description": "Compute unit rates associated with ratios of fractions, including ratios of lengths, areas and other quantities measured in like or different units.",
        "Skill": [
            {
                "name": "Calculate unit rates with whole numbers",
                "description": "Determine the unit rate from a given ratio involving whole number quantities.",
                "source": "IXL Content - Unit rates",
                "relationship": "Prerequisite skill"
            },
            {
                "name": "Compute unit rates with fractions",
                "description": "Calculate the unit rate when given a ratio involving fractional quantities, including complex fractions.",
                "source": "Khan Academy Content - Rates with fractions, IXL Content - Calculate unit rates with fractions",
                "relationship": "Exact match (Khan Academy), Exact match (IXL)"
            },
            {
                "name": "Solve real-world problems involving unit rates with fractions",
                "description": "Apply the concept of unit rates with fractions to solve practical problems involving various quantities (lengths, areas, prices, etc.).",
                "source": "Khan Academy Content - Rates with fractions",
                "relationship": "Subset"
            }
        ]
    },
    {
        "Standard ID": "7.RP.A.2.a",
        "Standard description": "Decide whether two quantities are in a proportional relationship, e.g., by testing for equivalent ratios in a table or graphing on a coordinate plane and observing whether the graph is a straight line through the origin.",
        "Skill": [
            {
                "name": "Identify proportional relationships from tables",
                "description": "Determine if a relationship represented in a table is proportional by checking for a constant ratio between quantities.",
                "source": "Khan Academy Content - Identify proportional relationships, Proportional relationships; IXL Content - Identify proportional relationships from tables; EngageNY Lessons - Comparing Proportional and Nonproportional Relationships, Lesson 7",
                "relationship": "Exact match (Khan Academy), Exact match (IXL), Exact match (EngageNY)"
            },
            {
                "name": "Identify proportional relationships from graphs",
                "description": "Determine if a relationship represented by a graph is proportional by verifying if it is a straight line passing through the origin.",
                "source": "Khan Academy Content - Identify proportional relationships from graphs; IXL Content - Identify proportional relationships by graphing; EngageNY Lessons - Representing Proportional Relationships with Graphs, Lesson 10",
                "relationship": "Exact match (Khan Academy), Exact match (IXL), Exact match (EngageNY)"
            },
            {
                "name": "Identify proportional relationships from equations",
                "description": "Recognize proportional relationships when represented by equations of the form y = kx.",
                "source": "Khan Academy Content - Identify proportional relationships; IXL Content - Identify proportional relationships from graphs and equations; EngageNY Lessons - Comparing Proportional and Nonproportional Relationships, Lesson 8",
                "relationship": "Exact match (Khan Academy), Subset (IXL), Exact match (EngageNY)"
            }
        ]
    },
    {
        "Standard ID": "7.RP.A.2.b",
        "Standard description": "Identify the constant of proportionality (unit rate) in tables, graphs, equations, diagrams, and verbal descriptions of proportional relationships.",
        "Skill": [
            {
                "name": "Find the constant of proportionality from tables",
                "description": "Calculate the constant of proportionality (unit rate) from a table of proportional values.",
                "source": "Khan Academy Content - Constant of proportionality from tables, Constant of proportionality from tables (with equations); IXL Content - Find the constant of proportionality from a table; EngageNY Lessons - Representing Proportional Relationships with Tables, Lesson 2, Lesson 3",
                "relationship": "Exact match (Khan Academy), Exact match (IXL), Exact match (EngageNY)"
            },
            {
                "name": "Find the constant of proportionality from graphs",
                "description": "Identify and calculate the constant of proportionality from the graph of a proportional relationship.",
                "source": "Khan Academy Content - Constant of proportionality from graphs; IXL Content - Find the constant of proportionality from a graph; EngageNY Lessons - Representing Proportional Relationships with Graphs, Lesson 11",
                "relationship": "Exact match (Khan Academy), Exact match (IXL), Exact match (EngageNY)"
            },
            {
                "name": "Find the constant of proportionality from equations",
                "description": "Identify the constant of proportionality (k) in an equation of a proportional relationship (y = kx).",
                "source": "Khan Academy Content - Constant of proportionality from equations",
                "relationship": "Exact match"
            },
            {
                "name": "Interpret the constant of proportionality in context",
                "description": "Explain the meaning of the constant of proportionality in various real-world scenarios.",
                "source": "Khan Academy Content - Interpret constants of proportionality",
                "relationship": "Exact match"
            },
            {
                "name": "Compare constants of proportionality",
                "description": "Compare constants of proportionality from different representations (tables, graphs, equations, verbal descriptions) of proportional relationships.",
                "source": "Khan Academy Content - Compare constants of proportionality",
                "relationship": "Exact match"
            }
        ]
    },
    {
        "Standard ID": "7.RP.A.2.c",
        "Standard description": "Represent proportional relationships by equations.",
        "Skill": [
            {
                "name": "Write equations for proportional relationships from tables",
                "description": "Given a table of proportional values, write an equation in the form y = kx to represent the relationship.",
                "source": "Khan Academy Content - Writing proportional equations from tables; IXL Content - Write equations for proportional relationships from tables; EngageNY Lessons - Representing Proportional Relationships with Equations, Lesson 4",
                "relationship": "Exact match (Khan Academy), Exact match (IXL), Exact match (EngageNY)"
            },
            {
                "name": "Write equations for proportional relationships from graphs",
                "description": "Given a graph of a proportional relationship, write an equation in the form y = kx to represent the relationship.",
                "source": "Khan Academy Content - Writing proportional equations; IXL Content - Write equations for proportional relationships from graphs",
                "relationship": "Exact match (Khan Academy), Exact match (IXL)"
            },
            {
                "name": "Write equations for proportional relationships from verbal descriptions",
                "description": "Translate a verbal description of a proportional relationship into an algebraic equation.",
                "source": "Khan Academy Content - Writing proportional equations",
                "relationship": "Exact match"
            },
            {
                "name": "Solve proportions using various methods",
                "description": "Solve for an unknown value in a proportion using cross-multiplication or other equivalent ratio strategies.",
                "source": "Khan Academy Content - Solving proportions, Writing proportions; IXL Content - Solve proportions",
                "relationship": "Exact match (Khan Academy), Exact match (IXL)"
            }
        ]
    },
    {
        "Standard ID": "7.RP.A.2.d",
        "Standard description": "Explain what a point (x, y) on the graph of a proportional relationship means in terms of the situation, with special attention to the points (0, 0) and (1, r) where r is the unit rate.",
        "Skill": [
            {
                "name": "Interpret points (x, y) on the graph of a proportional relationship",
                "description": "Explain the meaning of any point (x, y) on the graph of a proportional relationship in the context of the situation, focusing on the significance of (0, 0) and (1, r) where r is the unit rate.",
                "source": "Khan Academy Content - Interpreting graphs of proportional relationships; IXL Content - Interpret graphs of proportional relationships; EngageNY Lessons - Representing Proportional Relationships with Graphs, Lesson 11",
                "relationship": "Exact match (Khan Academy), Exact match (IXL), Exact match (EngageNY)"
            }
        ]
    },
    {
        "Standard ID": "7.RP.A.2",
        "Standard description": "Recognize and represent proportional relationships between quantities.",
        "Skill": [
            {
                "name": "Represent proportional relationships with multiple representations",
                "description": "Translate and represent proportional relationships between tables, graphs, equations, and verbal descriptions.",
                "source": "Khan Academy Content - Proportional relationships; EngageNY Lessons - Let’s Put It to Work, Lesson 14",
                "relationship": "Superset (Khan Academy), Exact match (EngageNY)"
            },
            {
                "name": "Solve word problems involving proportional relationships",
                "description": "Apply understanding of proportional relationships to solve multi-step real-world problems.",
                "source": "IXL Content - Solve proportions: word problems, Graph a proportional relationship: word problems, Write and solve equations for proportional relationships; EngageNY Lessons - Representing Proportional Relationships with Equations, Lesson 6, Comparing Proportional and Nonproportional Relationships, Lesson 9, Let’s Put It to Work, Lesson 15",
                "relationship": "Superset (IXL), Superset (EngageNY)"
            }
        ]
    },
    {
        "Standard ID": "7.RP.A.3",
        "Standard description": "Use proportional relationships to solve multistep ratio and percent problems.",
        "Skill": [
            {
                "name": "Understand the concept of percent as a rate per 100",
                "description": "Understand that a percentage represents a part of a whole expressed as a fraction of 100.",
                "source": "IXL Content - What percentage is illustrated?",
                "relationship": "Subset"
            },
            {
                "name": "Convert between percents, fractions, and decimals",
                "description": "Fluently convert numbers between percent, fraction, and decimal forms.",
                "source": "IXL Content - Convert between percents, fractions, and decimals",
                "relationship": "Exact match"
            },
            {
                "name": "Solve percent problems (finding the part, whole, or percent)",
                "description": "Solve problems to find the unknown part, the whole, or the percentage, given the other two quantities.",
                "source": "Khan Academy Content - Percent problems; IXL Content - Percents of numbers and money amounts, Solve percent equations, Solve percent problems using strip models",
                "relationship": "Exact match (Khan Academy), Superset (IXL)"
            },
            {
                "name": "Solve multistep ratio problems",
                "description": "Solve complex problems involving ratios that require multiple steps or a combination of ratio concepts.",
                "source": "Khan Academy Content - Proportion word problems; IXL Content - Compare ratios: word problems, Compare rates: word problems, Equivalent ratios: word problems, Solve proportions: word problems",
                "relationship": "Exact match (Khan Academy), Superset (IXL)"
            },
            {
                "name": "Calculate percent increase and decrease",
                "description": "Determine the percentage increase or decrease of a quantity relative to its original amount.",
                "source": "IXL Content - Percent of change; EngageNY Lessons - Percent Increase and Decrease, Lesson 6",
                "relationship": "Exact match (IXL), Exact match (EngageNY)"
            },
            {
                "name": "Solve word problems involving percent increase and decrease",
                "description": "Apply the concept of percent increase and decrease to solve real-world problems.",
                "source": "IXL Content - Percent of change: word problems; EngageNY Lessons - Percent Increase and Decrease, Lesson 7, Lesson 9, Let’s Put It to Work, Lesson 16",
                "relationship": "Exact match (IXL), Superset (EngageNY)"
            },
            {
                "name": "Solve word problems involving discounts, markups, and commissions",
                "description": "Calculate and apply discounts, markups, and commissions in real-world scenarios.",
                "source": "Khan Academy Content - Discount, markup, and commission word problems; IXL Content - Percent of a number: tax, discount, and more, Find the percent: tax, discount, and more, Sale prices: find the original price; EngageNY Lessons - Applying Percentages, Lesson 10, Lesson 11, Lesson 12",
                "relationship": "Exact match (Khan Academy), Superset (IXL), Superset (EngageNY)"
            },
            {
                "name": "Solve percent error problems",
                "description": "Calculate percent error and apply it in real-world contexts to understand measurement accuracy.",
                "source": "IXL Content - Percent error: word problems; EngageNY Lessons - Applying Percentages, Lesson 13, Lesson 14",
                "relationship": "Exact match (IXL), Exact match (EngageNY)"
            },
            {
                "name": "Solve multistep percent problems",
                "description": "Solve complex real-world problems that require multiple steps and integrate various percent concepts (e.g., tax, tip, discount, percent increase/decrease).",
                "source": "Khan Academy Content - Percent problems; IXL Content - Multi-step problems with percents; EngageNY Lessons - Applying Percentages, Lesson 12",
                "relationship": "Exact match (Khan Academy), Exact match (IXL), Superset (EngageNY)"
            },
            {
                "name": "Solve simple interest problems",
                "description": "Calculate simple interest given the principal, interest rate, and time.",
                "source": "IXL Content - Simple interest",
                "relationship": "Exact match"
            }
        ]
    },
    {
        "Standard ID": "7.NS.A.1",
        "Standard description": "Apply and extend previous understandings of addition and subtraction to add and subtract rational numbers; represent addition and subtraction on a horizontal or vertical number line diagram.",
        "Skill": [
            {
                "name": "Absolute value to find distance",
                "description": "Calculate the distance between two rational numbers on a number line using absolute value.",
                "source": "Khan Academy Content - Absolute value to find distance",
                "relationship": "Exact match"
            },
            {
                "name": "Absolute value to find distance challenge",
                "description": "Solve challenging problems involving finding the distance between rational numbers using absolute value, potentially in multi-step scenarios.",
                "source": "Khan Academy Content - Absolute value to find distance challenge",
                "relationship": "Exact match"
            },
            {
                "name": "Adding & subtracting negative numbers",
                "description": "Add and subtract negative numbers, including integers and other rational numbers.",
                "source": "Khan Academy Content - Adding & subtracting negative numbers",
                "relationship": "Exact match"
            },
            {
                "name": "Adding & subtracting rational numbers",
                "description": "Perform addition and subtraction with any rational numbers (integers, fractions, decimals, positive and negative).",
                "source": "Khan Academy Content - Adding & subtracting rational numbers",
                "relationship": "Exact match"
            },
            {
                "name": "Addition & subtraction: find the missing value",
                "description": "Solve for a missing value in addition and subtraction equations involving rational numbers.",
                "source": "Khan Academy Content - Addition & subtraction: find the missing value",
                "relationship": "Exact match"
            },
            {
                "name": "Equivalent expressions with negative numbers",
                "description": "Identify or create equivalent expressions involving negative numbers, focusing on addition and subtraction properties.",
                "source": "Khan Academy Content - Equivalent expressions with negative numbers",
                "relationship": "Exact match"
            },
            {
                "name": "Interpret negative number addition and subtraction expressions",
                "description": "Understand and explain the meaning of expressions involving addition and subtraction of negative numbers.",
                "source": "Khan Academy Content - Interpret negative number addition and subtraction expressions",
                "relationship": "Exact match"
            },
            {
                "name": "Interpreting negative number statements",
                "description": "Interpret and analyze statements involving negative numbers in real-world contexts related to addition and subtraction.",
                "source": "Khan Academy Content - Interpreting negative number statements",
                "relationship": "Exact match"
            },
            {
                "name": "Negative number addition and subtraction: word problems",
                "description": "Solve real-world word problems involving addition and subtraction of negative numbers.",
                "source": "Khan Academy Content - Negative number addition and subtraction: word problems",
                "relationship": "Exact match"
            },
            {
                "name": "One-step equations with negatives (add & subtract)",
                "description": "Solve one-step linear equations involving addition and subtraction of negative numbers.",
                "source": "Khan Academy Content - One-step equations with negatives (add & subtract)",
                "relationship": "Exact match"
            },
            {
                "name": "Order of operations with negative numbers",
                "description": "Apply the order of operations to expressions involving addition and subtraction of negative numbers.",
                "source": "Khan Academy Content - Order of operations with negative numbers",
                "relationship": "Exact match"
            },
            {
                "name": "Ordering negative number expressions",
                "description": "Order expressions involving negative numbers (created through addition or subtraction) from least to greatest or greatest to least.",
                "source": "Khan Academy Content - Ordering negative number expressions",
                "relationship": "Exact match"
            },
            {
                "name": "Substitution with negative numbers",
                "description": "Substitute negative numbers into expressions and evaluate them.",
                "source": "Khan Academy Content - Substitution with negative numbers",
                "relationship": "Exact match"
            }
        ]
    },
    {
        "Standard ID": "7.NS.A.1.a",
        "Standard description": "Describe situations in which opposite quantities combine to make 0.",
        "Skill": [
            {
                "name": "Quantities that combine to zero: word problems",
                "description": "Describe real-world situations where opposite quantities combine to make zero.",
                "source": "IXL Content - Quantities that combine to zero: word problems",
                "relationship": "Exact match"
            },
            {
                "name": "Signs of sums",
                "description": "Determine the sign of a sum involving positive and negative numbers, including cases where they combine to make zero.",
                "source": "Khan Academy Content - Signs of sums",
                "relationship": "Exact match"
            }
        ]
    },
    {
        "Standard ID": "7.NS.A.1.b",
        "Standard description": "Understand $p + q$ as the number located a distance $|q|$ from $p$, in the positive or negative direction depending on whether $q$ is positive or negative. Show that a number and its opposite have a sum of 0 (are additive inverses). Interpret sums of rational numbers by describing real-world contexts.",
        "Skill": [
            {
                "name": "Add with integer chips",
                "description": "Use integer chips to model and understand addition of integers, including how zero pairs are formed.",
                "source": "Khan Academy Content - Add with integer chips",
                "relationship": "Exact match"
            },
            {
                "name": "Adding negative numbers on the number line",
                "description": "Represent addition of negative numbers on a number line, understanding direction and distance.",
                "source": "Khan Academy Content - Adding negative numbers on the number line",
                "relationship": "Exact match"
            },
            {
                "name": "Number equations & number lines",
                "description": "Relate addition and subtraction equations of rational numbers to movements on a number line.",
                "source": "Khan Academy Content - Number equations & number lines",
                "relationship": "Exact match"
            },
            {
                "name": "Interpreting Negative Numbers",
                "description": "Interpret signed numbers in the context of real-world scenarios like temperature and elevation, understanding their meaning and magnitude.",
                "source": "EngageNY Content - Lesson 1: Interpreting Negative Numbers",
                "relationship": "Exact match"
            },
            {
                "name": "Changing Temperatures",
                "description": "Use a number line to model and solve problems involving changes in temperature, applying addition of positive and negative numbers.",
                "source": "EngageNY Content - Lesson 2: Changing Temperatures",
                "relationship": "Exact match"
            },
            {
                "name": "Changing Elevation",
                "description": "Understand how to add positive and negative numbers in general through the context of changing elevation.",
                "source": "EngageNY Content - Lesson 3: Changing Elevation",
                "relationship": "Exact match"
            },
            {
                "name": "Money and Debts",
                "description": "Understand how positive and negative numbers apply to financial situations and calculate account balances using addition of rational numbers.",
                "source": "EngageNY Content - Lesson 4: Money and Debts",
                "relationship": "Exact match"
            },
            {
                "name": "Add integers using counters",
                "description": "Model and solve integer addition problems using visual counters.",
                "source": "IXL Content - Add integers using counters",
                "relationship": "Exact match"
            },
            {
                "name": "Add integers using number lines",
                "description": "Model and solve integer addition problems using a number line.",
                "source": "IXL Content - Add integers using number lines",
                "relationship": "Exact match"
            },
            {
                "name": "Integer addition rules",
                "description": "Apply rules for adding integers with different signs and same signs.",
                "source": "IXL Content - Integer addition rules",
                "relationship": "Exact match"
            },
            {
                "name": "Add integers",
                "description": "Fluently add integers.",
                "source": "IXL Content - Add integers",
                "relationship": "Exact match"
            },
            {
                "name": "Add three or more integers",
                "description": "Add three or more integers efficiently.",
                "source": "IXL Content - Add three or more integers",
                "relationship": "Exact match"
            },
            {
                "name": "Understand absolute value",
                "description": "Understand the concept of absolute value as distance from zero.",
                "source": "IXL Content - Understanding absolute value",
                "relationship": "Exact match"
            },
            {
                "name": "Absolute value and opposite integers",
                "description": "Understand the relationship between absolute value and opposite integers.",
                "source": "IXL Content - Absolute value and opposite integers",
                "relationship": "Exact match"
            }
        ]
    },
    {
        "Standard ID": "7.NS.A.1.c",
        "Standard description": "Understand subtraction of rational numbers as adding the additive inverse, $p - q = p + (-q)$. Show that the distance between two rational numbers on the number line is the absolute value of their difference, and apply this principle in real-world contexts.",
        "Skill": [
            {
                "name": "Subtracting negative numbers",
                "description": "Subtract negative numbers, understanding that subtracting a negative is equivalent to adding a positive.",
                "source": "Khan Academy Content - Subtracting negative numbers",
                "relationship": "Exact match"
            },
            {
                "name": "Understand subtraction as adding the opposite",
                "description": "Formally understand and apply the rule that subtraction is equivalent to adding the additive inverse.",
                "source": "Khan Academy Content - Understand subtraction as adding the opposite",
                "relationship": "Exact match"
            },
            {
                "name": "Representing Subtraction",
                "description": "Use a number line to model and solve subtraction problems involving positive and negative numbers.",
                "source": "EngageNY Content - Lesson 5: Representing Subtraction",
                "relationship": "Exact match"
            },
            {
                "name": "Subtracting Rational Numbers",
                "description": "Solve subtraction expressions with rational numbers, including understanding the concept of working in reverse.",
                "source": "EngageNY Content - Lesson 6: Subtracting Rational Numbers",
                "relationship": "Exact match"
            },
            {
                "name": "Subtract integers using counters",
                "description": "Model and solve integer subtraction problems using visual counters.",
                "source": "IXL Content - Subtract integers using counters",
                "relationship": "Exact match"
            },
            {
                "name": "Subtract integers using number lines",
                "description": "Model and solve integer subtraction problems using a number line.",
                "source": "IXL Content - Subtract integers using number lines",
                "relationship": "Exact match"
            },
            {
                "name": "Integer subtraction rules",
                "description": "Apply rules for subtracting integers.",
                "source": "IXL Content - Integer subtraction rules",
                "relationship": "Exact match"
            },
            {
                "name": "Subtract integers",
                "description": "Fluently subtract integers.",
                "source": "IXL Content - Subtract integers",
                "relationship": "Exact match"
            },
            {
                "name": "Add and subtract integers using counters",
                "description": "Model and solve addition and subtraction problems using integer counters.",
                "source": "IXL Content - Add and subtract integers using counters",
                "relationship": "Exact match"
            }
        ]
    },
    {
        "Standard ID": "7.NS.A.1.d",
        "Standard description": "Apply properties of operations as strategies to add and subtract rational numbers.",
        "Skill": [
            {
                "name": "Adding & subtracting negative fractions",
                "description": "Add and subtract negative fractions, applying properties of operations.",
                "source": "Khan Academy Content - Adding & subtracting negative fractions",
                "relationship": "Exact match"
            },
            {
                "name": "Commutative and associative properties of addition with integers",
                "description": "Apply the commutative and associative properties of addition to simplify expressions with integers.",
                "source": "Khan Academy Content - Commutative and associative properties of addition with integers",
                "relationship": "Exact match"
            },
            {
                "name": "Adding and Subtracting to Solve Problems",
                "description": "Represent gains and losses using signed numbers and apply rational number addition and subtraction to solve real-world problems.",
                "source": "EngageNY Content - Lesson 7: Adding and Subtracting to Solve Problems",
                "relationship": "Exact match"
            },
            {
                "name": "Integer addition and subtraction rules",
                "description": "Apply combined rules for integer addition and subtraction.",
                "source": "IXL Content - Integer addition and subtraction rules",
                "relationship": "Exact match"
            },
            {
                "name": "Add and subtract integers",
                "description": "Fluently add and subtract integers.",
                "source": "IXL Content - Add and subtract integers",
                "relationship": "Exact match"
            },
            {
                "name": "Complete addition and subtraction equations with integers",
                "description": "Fill in missing values in addition and subtraction equations with integers.",
                "source": "IXL Content - Complete addition and subtraction equations with integers",
                "relationship": "Exact match"
            },
            {
                "name": "Add and subtract positive and negative decimals",
                "description": "Add and subtract decimals, including positive and negative values.",
                "source": "IXL Content - Add and subtract positive and negative decimals",
                "relationship": "Exact match"
            },
            {
                "name": "Add and subtract positive and negative fractions",
                "description": "Add and subtract fractions, including positive and negative values.",
                "source": "IXL Content - Add and subtract positive and negative fractions",
                "relationship": "Exact match"
            },
            {
                "name": "Add and subtract rational numbers",
                "description": "Fluently add and subtract rational numbers (integers, fractions, and decimals).",
                "source": "IXL Content - Add and subtract rational numbers",
                "relationship": "Exact match"
            }
        ]
    },
    {
        "Standard ID": "7.NS.A.2",
        "Standard description": "Apply and extend previous understandings of multiplication and division and of fractions to multiply and divide rational numbers.",
        "Skill": [
            {
                "name": "Dividing mixed numbers with negatives",
                "description": "Divide mixed numbers that include negative values.",
                "source": "Khan Academy Content - Dividing mixed numbers with negatives",
                "relationship": "Exact match"
            },
            {
                "name": "Dividing negative numbers",
                "description": "Perform division operations involving negative numbers.",
                "source": "Khan Academy Content - Dividing negative numbers",
                "relationship": "Exact match"
            },
            {
                "name": "Dividing positive and negative fractions",
                "description": "Divide fractions, including those with positive and negative values.",
                "source": "Khan Academy Content - Dividing positive and negative fractions",
                "relationship": "Exact match"
            },
            {
                "name": "Equivalent expressions with negative numbers (multiplication and division)",
                "description": "Identify or create equivalent expressions involving multiplication and division of negative numbers.",
                "source": "Khan Academy Content - Equivalent expressions with negative numbers (multiplication and division)",
                "relationship": "Exact match"
            },
            {
                "name": "Exponents with integer bases",
                "description": "Evaluate expressions with integer bases raised to whole-number exponents.",
                "source": "Khan Academy Content - Exponents with integer bases",
                "relationship": "Exact match"
            },
            {
                "name": "Multiplying & dividing negative numbers word problems",
                "description": "Solve real-world word problems involving multiplication and division of negative numbers.",
                "source": "Khan Academy Content - Multiplying & dividing negative numbers word problems",
                "relationship": "Exact match"
            },
            {
                "name": "Multiplying negative numbers",
                "description": "Perform multiplication operations involving negative numbers.",
                "source": "Khan Academy Content - Multiplying negative numbers",
                "relationship": "Exact match"
            },
            {
                "name": "Multiplying positive and negative fractions",
                "description": "Multiply fractions, including those with positive and negative values.",
                "source": "Khan Academy Content - Multiplying positive and negative fractions",
                "relationship": "Exact match"
            },
            {
                "name": "Negative signs in fractions",
                "description": "Understand the placement and meaning of negative signs in fractions.",
                "source": "Khan Academy Content - Negative signs in fractions",
                "relationship": "Exact match"
            },
            {
                "name": "One-step equations with negatives (multiply & divide)",
                "description": "Solve one-step linear equations involving multiplication and division of negative numbers.",
                "source": "Khan Academy Content - One-step equations with negatives (multiply & divide)",
                "relationship": "Exact match"
            },
            {
                "name": "Order of operations with negative numbers",
                "description": "Apply the order of operations to expressions involving multiplication and division of negative numbers.",
                "source": "Khan Academy Content - Order of operations with negative numbers",
                "relationship": "Subset"
            },
            {
                "name": "Signs of expressions",
                "description": "Determine the sign of the result of expressions involving multiplication and division of rational numbers.",
                "source": "Khan Academy Content - Signs of expressions",
                "relationship": "Exact match"
            },
            {
                "name": "Signs of expressions challenge",
                "description": "Solve challenging problems involving determining the signs of complex expressions with multiplication and division of rational numbers.",
                "source": "Khan Academy Content - Signs of expressions challenge",
                "relationship": "Exact match"
            },
            {
                "name": "Simplify complex fractions",
                "description": "Simplify complex fractions involving rational numbers.",
                "source": "Khan Academy Content - Simplify complex fractions",
                "relationship": "Exact match"
            }
        ]
    },
    {
        "Standard ID": "7.NS.A.2.a",
        "Standard description": "Understand that multiplication is extended from fractions to rational numbers by requiring that operations continue to satisfy the properties of operations, particularly the distributive property, leading to products such as $(-1)(-1) = 1$ and the rules for multiplying signed numbers. Interpret products of rational numbers by describing real-world contexts.",
        "Skill": [
            {
                "name": "Exponents with negative fractional bases",
                "description": "Evaluate expressions with negative fractional bases raised to whole-number exponents.",
                "source": "Khan Academy Content - Exponents with negative fractional bases",
                "relationship": "Exact match"
            },
            {
                "name": "Position, Speed, and Direction",
                "description": "Understand multiplication of signed numbers in the context of position, speed, and direction, and apply it to real-world scenarios.",
                "source": "EngageNY Content - Lesson 8: Position, Speed, and Direction",
                "relationship": "Exact match"
            },
            {
                "name": "Multiplying Rational Numbers",
                "description": "Interpret signed numbers for speed and direction and understand why multiplying two negative numbers results in a positive product.",
                "source": "EngageNY Content - Lesson 9: Multiplying Rational Numbers",
                "relationship": "Exact match"
            },
            {
                "name": "Multiply!",
                "description": "Multiply rational numbers, including expressions with multiple factors.",
                "source": "EngageNY Content - Lesson 10: Multiply! (Optional)",
                "relationship": "Exact match"
            },
            {
                "name": "Understand multiplying by a negative integer using a number line",
                "description": "Visualize and understand multiplication involving negative integers using a number line model.",
                "source": "IXL Content - Understand multiplying by a negative integer using a number line",
                "relationship": "Exact match"
            },
            {
                "name": "Integer multiplication rules",
                "description": "Apply rules for multiplying integers with different signs and same signs.",
                "source": "IXL Content - Integer multiplication rules",
                "relationship": "Exact match"
            },
            {
                "name": "Multiply integers",
                "description": "Fluently multiply integers.",
                "source": "IXL Content - Multiply integers",
                "relationship": "Exact match"
            }
        ]
    },
    {
        "Standard ID": "7.NS.A.2.b",
        "Standard description": "Understand that integers can be divided, provided that the divisor is not zero, and every quotient of integers (with non-zero divisor) is a rational number. If $p$ and $q$ are integers, then $-(p/q) = (-p)/q = p/(-q)$. Interpret quotients of rational numbers by describing real-world contexts.",
        "Skill": [
            {
                "name": "Dividing by zero",
                "description": "Understand why division by zero is undefined.",
                "source": "Khan Academy Content - Dividing by zero",
                "relationship": "Exact match"
            },
            {
                "name": "Dividing Rational Numbers",
                "description": "Use multiplication and division relationships to determine division rules for rational numbers.",
                "source": "EngageNY Content - Lesson 11: Dividing Rational Numbers",
                "relationship": "Exact match"
            },
            {
                "name": "Negative Rates",
                "description": "Multiply and divide rational numbers in constant rate problems involving negative values.",
                "source": "EngageNY Content - Lesson 12: Negative Rates (Teacher Instruction Only)",
                "relationship": "Exact match"
            },
            {
                "name": "Integer division rules",
                "description": "Apply rules for dividing integers with different signs and same signs.",
                "source": "IXL Content - Integer division rules",
                "relationship": "Exact match"
            },
            {
                "name": "Equal quotients of integers",
                "description": "Identify equal quotients involving negative integers.",
                "source": "IXL Content - Equal quotients of integers",
                "relationship": "Exact match"
            },
            {
                "name": "Divide integers",
                "description": "Fluently divide integers.",
                "source": "IXL Content - Divide integers",
                "relationship": "Exact match"
            }
        ]
    },
    {
        "Standard ID": "7.NS.A.2.c",
        "Standard description": "Apply properties of operations as strategies to multiply and divide rational numbers.",
        "Skill": [
            {
                "name": "Integer multiplication and division rules",
                "description": "Apply combined rules for integer multiplication and division.",
                "source": "IXL Content - Integer multiplication and division rules",
                "relationship": "Exact match"
            },
            {
                "name": "Multiply and divide integers",
                "description": "Fluently multiply and divide integers.",
                "source": "IXL Content - Multiply and divide integers",
                "relationship": "Exact match"
            },
            {
                "name": "Complete multiplication and division equations with integers",
                "description": "Fill in missing values in multiplication and division equations with integers.",
                "source": "IXL Content - Complete multiplication and division equations with integers",
                "relationship": "Exact match"
            },
            {
                "name": "Multiply and divide positive and negative decimals",
                "description": "Multiply and divide decimals, including positive and negative values.",
                "source": "IXL Content - Multiply and divide positive and negative decimals",
                "relationship": "Exact match"
            },
            {
                "name": "Multiply and divide positive and negative fractions",
                "description": "Multiply and divide fractions, including positive and negative values.",
                "source": "IXL Content - Multiply and divide positive and negative fractions",
                "relationship": "Exact match"
            },
            {
                "name": "Multiply and divide rational numbers",
                "description": "Fluently multiply and divide rational numbers (integers, fractions, and decimals).",
                "source": "IXL Content - Multiply and divide rational numbers",
                "relationship": "Exact match"
            }
        ]
    },
    {
        "Standard ID": "7.NS.A.2.d",
        "Standard description": "Convert a rational number to a decimal using long division; know that the decimal form of a rational number terminates in 0s or eventually repeats.",
        "Skill": [
            {
                "name": "Converting fractions to decimals",
                "description": "Convert fractions or mixed numbers to their decimal form using long division, recognizing terminating and repeating decimals.",
                "source": "Khan Academy Content - Converting fractions to decimals, IXL Content - Convert fractions or mixed numbers to decimals",
                "relationship": "Exact match"
            },
            {
                "name": "Order rational numbers",
                "description": "Order a set of rational numbers presented in various forms (fractions, decimals, integers).",
                "source": "Khan Academy Content - Order rational numbers",
                "relationship": "Exact match"
            }
        ]
    },
    {
        "Standard ID": "7.NS.A.3",
        "Standard description": "Solve real-world and mathematical problems involving the four operations with rational numbers.",
        "Skill": [
            {
                "name": "Expressions with Rational Numbers",
                "description": "Evaluate expressions using all four operations on rational numbers.",
                "source": "EngageNY Content - Lesson 13: Expressions with Rational Numbers",
                "relationship": "Exact match"
            },
            {
                "name": "Solving Problems with Rational Numbers",
                "description": "Apply rational number concepts and all four operations to solve real-world problems.",
                "source": "EngageNY Content - Lesson 14: Solving Problems with Rational Numbers",
                "relationship": "Exact match"
            },
            {
                "name": "Solving Equations With Rational Numbers",
                "description": "Solve equations involving negative numbers and all four operations.",
                "source": "EngageNY Content - Lesson 15: Solving Equations With Rational Numbers",
                "relationship": "Exact match"
            },
            {
                "name": "Representing Contexts with Equations",
                "description": "Write and solve equations for situations involving negative numbers and all four operations.",
                "source": "EngageNY Content - Lesson 16: Representing Contexts with Equations",
                "relationship": "Exact match"
            },
            {
                "name": "The Stock Market",
                "description": "Use positive and negative numbers to represent directed change and apply rational number operations in the context of the stock market.",
                "source": "EngageNY Content - Lesson 17: The Stock Market (Teacher Instruction Only)",
                "relationship": "Exact match"
            },
            {
                "name": "Add and subtract integers: word problems",
                "description": "Solve word problems involving addition and subtraction of integers.",
                "source": "IXL Content - Add and subtract integers: word problems",
                "relationship": "Exact match"
            },
            {
                "name": "Add, subtract, multiply, and divide integers",
                "description": "Perform all four operations with integers.",
                "source": "IXL Content - Add, subtract, multiply, and divide integers",
                "relationship": "Exact match"
            },
            {
                "name": "Add, subtract, multiply, or divide two decimals",
                "description": "Perform any of the four operations on two decimals.",
                "source": "IXL Content - Add, subtract, multiply, or divide two decimals",
                "relationship": "Exact match"
            },
            {
                "name": "Add, subtract, multiply, and divide decimals: word problems",
                "description": "Solve word problems involving all four operations with decimals.",
                "source": "IXL Content - Add, subtract, multiply, and divide decimals: word problems",
                "relationship": "Exact match"
            },
            {
                "name": "Add, subtract, multiply, and divide fractions and mixed numbers: word problems",
                "description": "Solve word problems involving all four operations with fractions and mixed numbers.",
                "source": "IXL Content - Add, subtract, multiply, and divide fractions and mixed numbers: word problems",
                "relationship": "Exact match"
            },
            {
                "name": "Multi-step word problems with positive rational numbers",
                "description": "Solve multi-step word problems involving rational numbers (positive values) and all four operations.",
                "source": "IXL Content - Multi-step word problems with positive rational numbers",
                "relationship": "Exact match"
            }
        ]
    },
    {
        "Standard ID": "7.EE.A.1",
        "Standard description": "Apply properties of operations as strategies to add, subtract, factor, and expand linear expressions with rational coefficients.",
        "Skill": [
            {
                "name": "Combining like terms with negative coefficients",
                "description": "Combine like terms in linear expressions, including those with negative rational coefficients.",
                "source": "Khan Academy Content - Combining like terms with negative coefficients",
                "relationship": "Exact match"
            },
            {
                "name": "Combining like terms with negative coefficients & distribution",
                "description": "Simplify linear expressions by combining like terms after applying the distributive property, including expressions with negative rational coefficients.",
                "source": "Khan Academy Content - Combining like terms with negative coefficients & distribution",
                "relationship": "Exact match"
            },
            {
                "name": "Combining like terms with rational coefficients",
                "description": "Combine like terms in linear expressions involving rational (fractional and decimal) coefficients.",
                "source": "Khan Academy Content - Combining like terms with rational coefficients",
                "relationship": "Exact match"
            },
            {
                "name": "Distributive property with variables (negative numbers)",
                "description": "Apply the distributive property to linear expressions involving variables and negative rational numbers.",
                "source": "Khan Academy Content - Distributive property with variables (negative numbers)",
                "relationship": "Exact match"
            },
            {
                "name": "Equivalent expressions: negative numbers & distribution",
                "description": "Generate and identify equivalent linear expressions by applying the distributive property with negative numbers.",
                "source": "Khan Academy Content - Equivalent expressions: negative numbers & distribution",
                "relationship": "Exact match"
            },
            {
                "name": "Subtraction in Equivalent Expressions",
                "description": "Apply the distributive property to expressions with negative coefficients, understanding subtraction as adding the opposite.",
                "source": "EngageNY Content - Lesson 18: Subtraction in Equivalent Expressions",
                "relationship": "Exact match"
            },
            {
                "name": "Expanding and Factoring",
                "description": "Use the distributive property to expand or factor linear expressions with rational coefficients.",
                "source": "EngageNY Content - Lesson 19: Expanding and Factoring",
                "relationship": "Exact match"
            },
            {
                "name": "Combining Like Terms (Part 1)",
                "description": "Write equivalent expressions with fewer terms by applying properties of operations to combine like terms.",
                "source": "EngageNY Content - Lesson 20: Combining Like Terms (Part 1)",
                "relationship": "Exact match"
            },
            {
                "name": "Combining Like Terms (Part 2)",
                "description": "Simplify expressions that include negative coefficients and parentheses by combining like terms.",
                "source": "EngageNY Content - Lesson 21: Combining Like Terms (Part 2)",
                "relationship": "Exact match"
            },
            {
                "name": "Combining Like Terms (Part 3)",
                "description": "Write equivalent expressions by fluently combining like terms, including various rational coefficients.",
                "source": "EngageNY Content - Lesson 22: Combining Like Terms (Part 3)",
                "relationship": "Exact match"
            },
            {
                "name": "Properties of addition and multiplication",
                "description": "Understand and apply the commutative, associative, and distributive properties to numerical and algebraic expressions.",
                "source": "IXL Content - Properties of addition and multiplication",
                "relationship": "Exact match"
            },
            {
                "name": "Simplify expressions by combining like terms: with algebra tiles",
                "description": "Use algebra tiles to model and simplify expressions by combining like terms.",
                "source": "IXL Content - Simplify expressions by combining like terms: with algebra tiles",
                "relationship": "Exact match"
            },
            {
                "name": "Simplify expressions by combining like terms",
                "description": "Simplify linear expressions by combining like terms with various coefficients.",
                "source": "IXL Content - Simplify expressions by combining like terms",
                "relationship": "Exact match"
            },
            {
                "name": "Multiply using the distributive property: area models",
                "description": "Use area models to understand and apply the distributive property to expressions.",
                "source": "IXL Content - Multiply using the distributive property: area models",
                "relationship": "Exact match"
            },
            {
                "name": "Multiply using the distributive property",
                "description": "Apply the distributive property to expand linear expressions.",
                "source": "IXL Content - Multiply using the distributive property",
                "relationship": "Exact match"
            },
            {
                "name": "Write equivalent expressions using properties",
                "description": "Write equivalent expressions by applying properties of operations (commutative, associative, distributive).",
                "source": "IXL Content - Write equivalent expressions using properties",
                "relationship": "Exact match"
            },
            {
                "name": "Add and subtract linear expressions",
                "description": "Add and subtract linear expressions with rational coefficients.",
                "source": "IXL Content - Add and subtract linear expressions",
                "relationship": "Exact match"
            },
            {
                "name": "Factor linear expressions: area models",
                "description": "Use area models to understand and apply factoring to linear expressions.",
                "source": "IXL Content - Factor linear expressions: area models",
                "relationship": "Exact match"
            },
            {
                "name": "Factors of linear expressions",
                "description": "Factor linear expressions by identifying common factors.",
                "source": "IXL Content - Factors of linear expressions",
                "relationship": "Exact match"
            }
        ]
    },
    {
        "Standard ID": "7.EE.A.2",
        "Standard description": "Understand that rewriting an expression in different forms in a problem context can shed light on the problem and how the quantities in it are related.",
        "Skill": [
            {
                "name": "Interpreting linear expressions",
                "description": "Interpret the meaning of parts of a linear expression in terms of a real-world context.",
                "source": "Khan Academy Content - Interpreting linear expressions",
                "relationship": "Exact match"
            },
            {
                "name": "Writing expressions word problems",
                "description": "Write linear expressions to represent real-world situations, understanding how different forms can highlight relationships.",
                "source": "Khan Academy Content - Writing expressions word problems",
                "relationship": "Exact match"
            },
            {
                "name": "Identify equivalent linear expressions using algebra tiles",
                "description": "Use algebra tiles to visually identify equivalent linear expressions.",
                "source": "IXL Content - Identify equivalent linear expressions using algebra tiles",
                "relationship": "Exact match"
            },
            {
                "name": "Identify equivalent linear expressions I",
                "description": "Identify equivalent linear expressions through algebraic manipulation.",
                "source": "IXL Content - Identify equivalent linear expressions I",
                "relationship": "Exact match"
            },
            {
                "name": "Identify equivalent linear expressions II",
                "description": "Identify more complex equivalent linear expressions through algebraic manipulation.",
                "source": "IXL Content - Identify equivalent linear expressions II",
                "relationship": "Exact match"
            },
            {
                "name": "Identify equivalent linear expressions: word problems",
                "description": "Identify equivalent linear expressions that represent the same real-world situation.",
                "source": "IXL Content - Identify equivalent linear expressions: word problems",
                "relationship": "Exact match"
            }
        ]
    },
    {
        "Standard ID": "7.EE.B.3",
        "Standard description": "Solve multi-step real-life and mathematical problems posed with positive and negative rational numbers in any form (whole numbers, fractions, and decimals), using tools strategically. Apply properties of operations to calculate with numbers in any form; convert between forms as appropriate; and assess the reasonableness of answers using mental computation and estimation strategies.",
        "Skill": [
            {
                "name": "Rational number word problems",
                "description": "Solve multi-step word problems involving rational numbers (positive and negative, in various forms: whole numbers, fractions, and decimals), using appropriate strategies and tools.",
                "source": "Khan Academy Content - Rational number word problems",
                "relationship": "Exact match"
            },
            {
                "name": "Rewriting decimals as fractions challenge",
                "description": "Convert repeating decimals to fractions, a foundational skill for working with rational numbers in different forms.",
                "source": "Khan Academy Content - Rewriting decimals as fractions challenge",
                "relationship": "Exact match"
            },
            {
                "name": "Add and subtract decimals: word problems",
                "description": "Solve real-world problems involving addition and subtraction of decimals.",
                "source": "IXL Content - Add and subtract decimals: word problems",
                "relationship": "Exact match"
            },
            {
                "name": "Multiply decimals and whole numbers: word problems",
                "description": "Solve real-world problems involving multiplication of decimals and whole numbers.",
                "source": "IXL Content - Multiply decimals and whole numbers: word problems",
                "relationship": "Exact match"
            },
            {
                "name": "Divide decimals by whole numbers: word problems",
                "description": "Solve real-world problems involving division of decimals by whole numbers.",
                "source": "IXL Content - Divide decimals by whole numbers: word analysis",
                "relationship": "Exact match"
            },
            {
                "name": "Estimate sums, differences, and products of decimals",
                "description": "Use estimation strategies to assess the reasonableness of answers for decimal operations.",
                "source": "IXL Content - Estimate sums, differences, and products of decimals",
                "relationship": "Exact match"
            },
            {
                "name": "Add, subtract, multiply, and divide decimals: word problems",
                "description": "Solve multi-step real-world problems involving all four operations with decimals.",
                "source": "IXL Content - Add, subtract, multiply, and divide decimals: word problems",
                "relationship": "Exact match"
            },
            {
                "name": "Maps with decimal distances",
                "description": "Solve problems involving distances on maps using decimal operations.",
                "source": "IXL Content - Maps with decimal distances",
                "relationship": "Exact match"
            },
            {
                "name": "Evaluate numerical expressions involving decimals",
                "description": "Evaluate numerical expressions involving decimals, applying order of operations.",
                "source": "IXL Content - Evaluate numerical expressions involving decimals",
                "relationship": "Exact match"
            },
            {
                "name": "Add and subtract fractions: word problems",
                "description": "Solve real-world problems involving addition and subtraction of fractions.",
                "source": "IXL Content - Add and subtract fractions: word problems",
                "relationship": "Exact match"
            },
            {
                "name": "Add and subtract mixed numbers: word problems",
                "description": "Solve real-world problems involving addition and subtraction of mixed numbers.",
                "source": "IXL Content - Add and subtract mixed numbers: word problems",
                "relationship": "Exact match"
            },
            {
                "name": "Estimate sums and differences of mixed numbers",
                "description": "Use estimation strategies to assess the reasonableness of answers for mixed number operations.",
                "source": "IXL Content - Estimate sums and differences of mixed numbers",
                "relationship": "Exact match"
            },
            {
                "name": "Multiply fractions and mixed numbers: word problems",
                "description": "Solve real-world problems involving multiplication of fractions and mixed numbers.",
                "source": "IXL Content - Multiply fractions and mixed numbers: word problems",
                "relationship": "Exact match"
            },
            {
                "name": "Divide fractions and mixed numbers: word problems",
                "description": "Solve real-world problems involving division of fractions and mixed numbers.",
                "source": "IXL Content - Divide fractions and mixed numbers: word problems",
                "relationship": "Exact match"
            },
            {
                "name": "Estimate products and quotients of fractions and mixed numbers",
                "description": "Use estimation strategies to assess the reasonableness of answers for fraction and mixed number operations.",
                "source": "IXL Content - Estimate products and quotients of fractions and mixed numbers",
                "relationship": "Exact match"
            },
            {
                "name": "Maps with fractional distances",
                "description": "Solve problems involving distances on maps using fractional operations.",
                "source": "IXL Content - Maps with fractional distances",
                "relationship": "Exact match"
            },
            {
                "name": "Evaluate numerical expressions involving fractions",
                "description": "Evaluate numerical expressions involving fractions, applying order of operations.",
                "source": "IXL Content - Evaluate numerical expressions involving fractions",
                "relationship": "Exact match"
            },
            {
                "name": "Multi-step word problems with positive rational numbers",
                "description": "Solve multi-step word problems involving positive rational numbers using all four operations.",
                "source": "IXL Content - Multi-step word problems with positive rational numbers",
                "relationship": "Exact match"
            }
        ]
    },
    {
        "Standard ID": "7.EE.B.4",
        "Standard description": "Use variables to represent quantities in a real-world or mathematical problem, and construct simple equations and inequalities to solve problems by reasoning about the quantities.",
        "Skill": [
            {
                "name": "Testing solutions to inequalities",
                "description": "Determine whether a given value is a solution to a linear inequality.",
                "source": "Khan Academy Content - Testing solutions to inequalities",
                "relationship": "Exact match"
            },
            {
                "name": "Relationships between Quantities",
                "description": "Find unknown values in relationships and interpret them as proportional or not proportional, leading to equation building.",
                "source": "EngageNY Content - Lesson 1: Relationships between Quantities",
                "relationship": "Exact match"
            },
            {
                "name": "Reasoning about Contexts with Tape Diagrams (Part 1)",
                "description": "Interpret tape diagrams representing word problems and use them to find unknown values, laying groundwork for equation solving.",
                "source": "EngageNY Content - Lesson 2: Reasoning about Contexts with Tape Diagrams (Part 1)",
                "relationship": "Exact match"
            },
            {
                "name": "Reasoning about Contexts with Tape Diagrams (Part 2)",
                "description": "Write and match equations with tape diagrams representing the same situation, connecting visual models to algebraic representations.",
                "source": "EngageNY Content - Lesson 3: Reasoning about Contexts with Tape Diagrams (Part 2)",
                "relationship": "Exact match"
            },
            {
                "name": "Reasoning about Equations and Tape Diagrams (Part 1)",
                "description": "Coordinate tape diagrams, equations of the form $px+q=r$, and verbal descriptions to interpret solutions in context.",
                "source": "EngageNY Content - Lesson 4: Reasoning about Equations and Tape Diagrams (Part 1)",
                "relationship": "Exact match"
            },
            {
                "name": "Reasoning about Equations and Tape Diagrams (Part 2)",
                "description": "Coordinate tape diagrams, equations of the form $p(x+q)=r$, and verbal descriptions to interpret solutions in context.",
                "source": "EngageNY Content - Lesson 5: Reasoning about Equations and Tape Diagrams (Part 2)",
                "relationship": "Exact match"
            },
            {
                "name": "Distinguishing between Two Types of Situations",
                "description": "Write and categorize equations of the forms $px+q=r$ and $p(x+q)=r$ from given situations and tape diagrams.",
                "source": "EngageNY Content - Lesson 6: Distinguishing between Two Types of Situations",
                "relationship": "Exact match"
            },
            {
                "name": "Reasoning about Solving Equations (Part 1)",
                "description": "Use balanced hanger diagrams to visualize and write equations of the form $px+q=r$, and solve them.",
                "source": "EngageNY Content - Lesson 7: Reasoning about Solving Equations (Part 1)",
                "relationship": "Exact match"
            },
            {
                "name": "Reasoning about Solving Equations (Part 2)",
                "description": "Use balanced hanger diagrams to visualize and write equations of the form $p(x+q)=r$, and solve them.",
                "source": "EngageNY Content - Lesson 8: Reasoning about Solving Equations (Part 2)",
                "relationship": "Exact match"
            },
            {
                "name": "Dealing with Negative Numbers",
                "description": "Solve equations of the forms $px+q=r$ and $p(x+q)=r$ that involve negative numbers.",
                "source": "EngageNY Content - Lesson 9: Dealing with Negative Numbers",
                "relationship": "Exact match"
            },
            {
                "name": "Different Options for Solving One Equation",
                "description": "Choose between expanding using the distributive property or dividing both sides by $p$ when solving equations.",
                "source": "EngageNY Content - Lesson 10: Different Options for Solving One Equation",
                "relationship": "Exact match"
            },
            {
                "name": "Using Tape Diagrams and Equations to Solve Problems",
                "description": "Translate real-world word problems into equations using tape diagrams and solve for unknown values.",
                "source": "EngageNY Content - Lesson 11: Using Tape Diagrams and Equations to Solve Problems",
                "relationship": "Exact match"
            },
            {
                "name": "Solving Problems about Percent Increase or Decrease",
                "description": "Solve word problems about percent increase or decrease using tape diagrams and equations.",
                "source": "EngageNY Content - Lesson 12: Solving Problems about Percent Increase or Decrease",
                "relationship": "Exact match"
            },
            {
                "name": "Reintroducing Inequalities",
                "description": "Write inequality statements to represent situations and use substitution to check solutions.",
                "source": "EngageNY Content - Lesson 13: Reintroducing Inequalities",
                "relationship": "Exact match"
            },
            {
                "name": "Finding Solutions to Inequalities in Context",
                "description": "Write inequalities that represent real-world situations and determine valid solutions for the inequality.",
                "source": "EngageNY Content - Lesson 14: Finding Solutions to Inequalities in Context",
                "relationship": "Exact match"
            },
            {
                "name": "Efficiently Solving Inequalities",
                "description": "Solve inequalities by using associated equations and testing values to determine the direction of the solution set.",
                "source": "EngageNY Content - Lesson 15: Efficiently Solving Inequalities",
                "relationship": "Exact match"
            },
            {
                "name": "Inequalities in Context",
                "description": "Match an inequality to a real-world scenario, solve it, and interpret the meaning of the solution in that context.",
                "source": "EngageNY Content - Lesson 16: Inequalities in Context",
                "relationship": "Exact match"
            },
            {
                "name": "Modeling with Inequalities",
                "description": "Write and solve inequalities for real-world problems and analyze their solutions and their implications.",
                "source": "EngageNY Content - Lesson 17: Modeling with Inequalities",
                "relationship": "Exact match"
            },
            {
                "name": "Write an equation from words",
                "description": "Translate verbal descriptions into algebraic equations.",
                "source": "IXL Content - Write an equation from words",
                "relationship": "Exact match"
            },
            {
                "name": "Solve equations using properties",
                "description": "Solve equations by applying properties of equality.",
                "source": "IXL Content - Solve equations using properties",
                "relationship": "Exact match"
            },
            {
                "name": "Model and solve equations using algebra tiles",
                "description": "Use algebra tiles to model and solve one- and two-step equations.",
                "source": "IXL Content - Model and solve equations using algebra tiles",
                "relationship": "Exact match"
            },
            {
                "name": "Write and solve equations that represent diagrams",
                "description": "Write and solve equations based on visual diagrams (e.g., tape diagrams, hanger diagrams).",
                "source": "IXL Content - Write and solve equations that represent diagrams",
                "relationship": "Exact match"
            },
            {
                "name": "Solutions to inequalities",
                "description": "Determine if a given value is a solution to an inequality.",
                "source": "IXL Content - Solutions to inequalities",
                "relationship": "Exact match"
            },
            {
                "name": "Graph inequalities on number lines",
                "description": "Graph the solution set of an inequality on a number line.",
                "source": "IXL Content - Graph inequalities on number lines",
                "relationship": "Exact match"
            },
            {
                "name": "Write inequalities from number lines",
                "description": "Write an inequality that represents a given graph on a number line.",
                "source": "IXL Content - Write inequalities from number lines",
                "relationship": "Exact match"
            }
        ]
    },
    {
        "Standard ID": "7.EE.B.4.a",
        "Standard description": "Solve word problems leading to equations of the form $px + q = r$ and $p(x + q) = r$, where $p$, $q$, and $r$ are specific rational numbers. Solve equations of these forms fluently. Compare an algebraic solution to an arithmetic solution, identifying the sequence of the operations used in each approach.",
        "Skill": [
            {
                "name": "Find the mistake: two-step equations",
                "description": "Identify and correct errors in the process of solving two-step linear equations.",
                "source": "Khan Academy Content - Find the mistake: two-step equations",
                "relationship": "Exact match"
            },
            {
                "name": "Two-step equations",
                "description": "Solve two-step linear equations of the form $px+q=r$.",
                "source": "Khan Academy Content - Two-step equations",
                "relationship": "Exact match"
            },
            {
                "name": "Two-step equations with decimals and fractions",
                "description": "Solve two-step linear equations where coefficients and constants are decimals or fractions.",
                "source": "Khan Academy Content - Two-step equations with decimals and fractions",
                "relationship": "Exact match"
            },
            {
                "name": "Two-step equations word problems",
                "description": "Translate and solve real-world word problems by setting up two-step linear equations.",
                "source": "Khan Academy Content - Two-step equations word problems",
                "relationship": "Exact match"
            },
            {
                "name": "Solve one-step equations",
                "description": "Solve one-step linear equations with rational numbers.",
                "source": "IXL Content - Solve one-step equations",
                "relationship": "Exact match"
            },
            {
                "name": "Solve one-step equations with decimals and fractions",
                "description": "Solve one-step linear equations where coefficients and constants are decimals or fractions.",
                "source": "IXL Content - Solve one-step equations with decimals and fractions",
                "relationship": "Exact match"
            },
            {
                "name": "Solve two-step equations without parentheses",
                "description": "Solve two-step linear equations of the form $px+q=r$ without parentheses.",
                "source": "IXL Content - Solve two-step equations without parentheses",
                "relationship": "Exact match"
            },
            {
                "name": "Solve two-step equations with parentheses",
                "description": "Solve two-step linear equations of the form $p(x+q)=r$ involving parentheses.",
                "source": "IXL Content - Solve two-step equations with parentheses",
                "relationship": "Exact match"
            },
            {
                "name": "Solve two-step equations",
                "description": "Fluently solve two-step linear equations of both forms $px+q=r$ and $p(x+q)=r$.",
                "source": "IXL Content - Solve two-step equations",
                "relationship": "Exact match"
            },
            {
                "name": "Solve two-step equations with fractions",
                "description": "Solve two-step linear equations where coefficients and constants are fractions.",
                "source": "IXL Content - Solve two-step equations with fractions",
                "relationship": "Exact match"
            },
            {
                "name": "Choose two-step equations: word problems",
                "description": "Select the correct two-step equation to represent a given word problem.",
                "source": "IXL Content - Choose two-step equations: word problems",
                "relationship": "Exact match"
            },
            {
                "name": "Solve two-step equations: word problems",
                "description": "Solve real-world word problems by setting up and solving two-step linear equations.",
                "source": "IXL Content - Solve two-step equations: word problems",
                "relationship": "Exact match"
            },
            {
                "name": "Solve equations involving like terms",
                "description": "Solve linear equations that require combining like terms before solving.",
                "source": "IXL Content - Solve equations involving like terms",
                "relationship": "Exact match"
            },
            {
                "name": "Solve equations: complete the solution",
                "description": "Complete the steps to solve linear equations, demonstrating understanding of the solution process.",
                "source": "IXL Content - Solve equations: complete the solution",
                "relationship": "Exact match"
            }
        ]
    },
    {
        "Standard ID": "7.EE.B.4.b",
        "Standard description": "Solve word problems leading to inequalities of the form $px + q > r$ or $px + q < r$, where $p$, $q$, and $r$ are specific rational numbers. Graph the solution set of the inequality and interpret it in the context of the problem.",
        "Skill": [
            {
                "name": "One-step inequalities",
                "description": "Solve one-step linear inequalities of the form $px+q>r$ or $px+q<r$ and graph their solution sets.",
                "source": "Khan Academy Content - One-step inequalities",
                "relationship": "Exact match"
            },
            {
                "name": "Two-step inequalities",
                "description": "Solve two-step linear inequalities of the form $px+q>r$ or $px+q<r$ and graph their solution sets.",
                "source": "Khan Academy Content - Two-step inequalities",
                "relationship": "Exact match"
            },
            {
                "name": "Two-step inequality word problems",
                "description": "Translate and solve real-world word problems by setting up two-step linear inequalities, and interpret the solution in context.",
                "source": "Khan Academy Content - Two-step inequality word problems",
                "relationship": "Exact match"
            },
            {
                "name": "Solve one-step inequalities",
                "description": "Solve one-step linear inequalities.",
                "source": "IXL Content - Solve one-step inequalities",
                "relationship": "Exact match"
            },
            {
                "name": "Graph solutions to one-step inequalities",
                "description": "Graph the solution sets of one-step inequalities on a number line.",
                "source": "IXL Content - Graph solutions to one-step inequalities",
                "relationship": "Exact match"
            },
            {
                "name": "One-step inequalities: word problems",
                "description": "Solve real-world word problems by setting up and solving one-step inequalities.",
                "source": "IXL Content - One-step inequalities: word problems",
                "relationship": "Exact match"
            },
            {
                "name": "Solve two-step inequalities",
                "description": "Solve two-step linear inequalities.",
                "source": "IXL Content - Solve two-step inequalities",
                "relationship": "Exact match"
            },
            {
                "name": "Graph solutions to two-step inequalities",
                "description": "Graph the solution sets of two-step inequalities on a number line.",
                "source": "IXL Content - Graph solutions to two-step inequalities",
                "relationship": "Exact match"
            }
        ]
    },
    {
        "Standard ID": "7.SP.A.1",
        "Standard description": "Understand that statistics can be used to gain information about a population by examining a sample of the population; generalizations about a population from a sample are valid only if the sample is representative of that population. Understand that random sampling tends to produce representative samples and support valid inferences.",
        "Skill": [
            {
                "name": "Populations and samples",
                "description": "Differentiate between a population and a sample in statistical contexts.",
                "source": "IXL Content - Populations and samples",
                "relationship": "Exact match"
            },
            {
                "name": "Understand populations, samples, and why sampling might be used",
                "description": "Explain the concepts of populations and samples, and identify situations where sampling is appropriate for gathering information.",
                "source": "EngageNY Content - Lesson 12: Larger Populations",
                "relationship": "Exact match"
            },
            {
                "name": "Identify representative, random, and biased samples",
                "description": "Distinguish between representative, random, and biased samples and understand their implications for drawing valid inferences.",
                "source": "IXL Content - Identify representative, random, and biased samples",
                "relationship": "Exact match"
            },
            {
                "name": "Evaluate whether a sample is representative of a population using dot plots",
                "description": "Analyze dot plots of samples to evaluate whether they are representative of a given population.",
                "source": "EngageNY Content - Lesson 13: What Makes a Good Sample?",
                "relationship": "Exact match"
            },
            {
                "name": "Recognize how random sampling leads to representative samples and valid inferences",
                "description": "Explain the importance of random sampling in producing representative samples and supporting valid statistical inferences about a population.",
                "source": "EngageNY Content - Lesson 14: Sampling in a Fair Way",
                "relationship": "Exact match"
            },
            {
                "name": "Valid claims",
                "description": "Evaluate statistical claims to determine if they are valid based on whether the sample was representative and random.",
                "source": "Khan Academy Content - Valid claims",
                "relationship": "Exact match"
            }
        ]
    },
    {
        "Standard ID": "7.SP.A.2",
        "Standard description": "Use data from a random sample to draw inferences about a population with an unknown characteristic of interest. Generate multiple samples (or simulated samples) of the same size to gauge the variation in estimates or predictions.",
        "Skill": [
            {
                "name": "Making inferences from random samples",
                "description": "Draw conclusions and make predictions about a population based on data from a random sample.",
                "source": "Khan Academy Content - Making inferences from random samples",
                "relationship": "Exact match"
            },
            {
                "name": "Make inferences from multiple samples",
                "description": "Draw inferences about a population by analyzing and comparing multiple random samples of the same size, observing the variability in estimates.",
                "source": "IXL Content - Make inferences from multiple samples",
                "relationship": "Exact match"
            },
            {
                "name": "Estimating Population Proportions",
                "description": "Use proportions from random samples to infer information about a population, including proportions of a characteristic.",
                "source": "EngageNY Content - Lesson 16: Estimating Population Proportions",
                "relationship": "Exact match"
            },
            {
                "name": "More about Sampling Variability (Optional)",
                "description": "Compare distributions of sample means using dot plots to understand and gauge sampling variability.",
                "source": "EngageNY Content - Lesson 17: More about Sampling Variability (Optional)",
                "relationship": "Exact match"
            },
            {
                "name": "Generate a random sample and use it to make population inferences",
                "description": "Perform a simple random sampling procedure and use the collected data to make inferences about the larger population.",
                "source": "EngageNY Content - Lesson 20: Memory Test (Optional)",
                "relationship": "Exact match"
            }
        ]
    },
    {
        "Standard ID": "7.SP.B.3",
        "Standard description": "Informally assess the degree of visual overlap of two numerical data distributions with similar variabilities, measuring the difference between the centers by expressing it as a multiple of a measure of variability.",
        "Skill": [
            {
                "name": "Comparing distributions",
                "description": "Informally compare the visual overlap of two numerical data distributions, assessing similarities in variability and measuring the difference in centers.",
                "source": "Khan Academy Content - Comparing distributions",
                "relationship": "Exact match"
            },
            {
                "name": "Calculate mean absolute deviation",
                "description": "Calculate the mean absolute deviation (MAD) for a set of numerical data.",
                "source": "IXL Content - Calculate mean absolute deviation",
                "relationship": "Subset"
            },
            {
                "name": "Justify differences between populations based on their means expressed as a multiple of the mean absolute deviation",
                "description": "Assess the difference between the centers of two distributions by expressing it as a multiple of a measure of variability (e.g., MAD).",
                "source": "EngageNY Content - Lesson 11: Comparing Groups",
                "relationship": "Exact match"
            }
        ]
    },
    {
        "Standard ID": "7.SP.B.4",
        "Standard description": "Use measures of center and measures of variability for numerical data from random samples to draw informal comparative inferences about two populations.",
        "Skill": [
            {
                "name": "Calculate mean, median, mode, and range",
                "description": "Calculate measures of center (mean, median, mode) and measures of variability (range) for numerical data sets.",
                "source": "IXL Content - Calculate mean, median, mode, and range",
                "relationship": "Subset"
            },
            {
                "name": "Interpret charts and graphs to find mean, median, mode, and range",
                "description": "Extract information from charts and graphs to determine measures of center and spread.",
                "source": "IXL Content - Interpret charts and graphs to find mean, median, mode, and range",
                "relationship": "Subset"
            },
            {
                "name": "Mean, median, mode, and range: find the missing number",
                "description": "Solve problems to find a missing number in a data set given its mean, median, mode, or range.",
                "source": "IXL Content - Mean, median, mode, and range: find the missing number",
                "relationship": "Subset"
            },
            {
                "name": "Changes in mean, median, mode, and range",
                "description": "Analyze how changes in data points affect the mean, median, mode, and range.",
                "source": "IXL Content - Changes in mean, median, mode, and range",
                "relationship": "Subset"
            },
            {
                "name": "Calculate quartiles and interquartile range",
                "description": "Calculate quartiles and the interquartile range (IQR) for a set of numerical data.",
                "source": "IXL Content - Calculate quartiles and interquartile range",
                "relationship": "Subset"
            },
            {
                "name": "Identify an outlier",
                "description": "Identify outliers in a data set and understand their potential impact on measures of center and spread.",
                "source": "IXL Content - Identify an outlier",
                "relationship": "Subset"
            },
            {
                "name": "Compare populations using measures of center and spread",
                "description": "Draw informal comparative inferences about two populations using their measures of center (mean, median) and measures of variability (range, IQR, MAD) from random samples.",
                "source": "IXL Content - Compare populations using measures of center and spread, Khan Academy Content - Comparing distributions",
                "relationship": "Exact match for IXL, Superset for Khan Academy"
            },
            {
                "name": "Estimating Population Measures of Center",
                "description": "Use the mean and MAD of a sample to infer characteristics about the center of a population.",
                "source": "EngageNY Content - Lesson 15: Estimating Population Measures of Center",
                "relationship": "Exact match"
            },
            {
                "name": "Compare populations using samples and reasoning about variability",
                "description": "Apply reasoning about measures of center and spread to determine if two populations are meaningfully different based on their samples.",
                "source": "EngageNY Content - Lesson 18: Comparing Populations Using Samples, EngageNY Content - Lesson 19: Comparing Populations with Friends (Teacher Instruction Only)",
                "relationship": "Exact match"
            }
        ]
    },
    {
        "Standard ID": "7.SP.C.5",
        "Standard description": "Understand that the probability of a chance event is a number between 0 and 1 that expresses the likelihood of the event occurring. Larger numbers indicate greater likelihood. A probability near 0 indicates an unlikely event, a probability around 1/2 indicates an event that is neither unlikely nor likely, and a probability near 1 indicates a likely event.",
        "Skill": [
            {
                "name": "Comparing probabilities",
                "description": "Compare the likelihood of different chance events based on their probabilities (values between 0 and 1).",
                "source": "Khan Academy Content - Comparing probabilities",
                "relationship": "Exact match"
            },
            {
                "name": "Describe the likelihood of events and order events from least likely to most likely",
                "description": "Qualitatively describe the likelihood of events (impossible, unlikely, equally likely, likely, certain) and order them based on their probability.",
                "source": "EngageNY Content - Lesson 2: Chance Experiments",
                "relationship": "Exact match"
            }
        ]
    },
    {
        "Standard ID": "7.SP.C.6",
        "Standard description": "Approximate the probability of a chance event by collecting data on the chance process that produces it and observing its long-run relative frequency, and predict the approximate relative frequency given the probability.",
        "Skill": [
            {
                "name": "Experimental probability",
                "description": "Calculate the experimental probability of a chance event based on collected data and observed frequencies.",
                "source": "Khan Academy Content - Experimental probability, IXL Content - Experimental probability",
                "relationship": "Exact match"
            },
            {
                "name": "Making predictions with probability",
                "description": "Use experimental or theoretical probability to make predictions about the approximate relative frequency of future events.",
                "source": "Khan Academy Content - Making predictions with probability",
                "relationship": "Exact match"
            },
            {
                "name": "Determine the likelihood of an event using results from previous experiments",
                "description": "Use data from past experiments to estimate the likelihood of future events.",
                "source": "EngageNY Content - Lesson 1: Mystery Bags",
                "relationship": "Exact match"
            },
            {
                "name": "Generalize that the cumulative relative frequency approaches the probability of an event as experiments are repeated",
                "description": "Understand and apply the concept of the law of large numbers, where relative frequency converges to theoretical probability over many trials.",
                "source": "EngageNY Content - Lesson 4: Estimating Probabilities Through Repeated Experiments",
                "relationship": "Exact match"
            },
            {
                "name": "Use results from repeated experiments to estimate the probability of an event",
                "description": "Calculate and use estimated probabilities based on the results of repeated chance experiments.",
                "source": "EngageNY Content - Lesson 5: More Estimating Probabilities",
                "relationship": "Exact match"
            },
            {
                "name": "Make predictions using experimental probability",
                "description": "Use experimental probability to predict outcomes in a series of future events.",
                "source": "IXL Content - Make predictions using experimental probability",
                "relationship": "Exact match"
            },
            {
                "name": "Use collected data to find probabilities and make predictions",
                "description": "Analyze collected data to determine probabilities and make predictions about future occurrences.",
                "source": "IXL Content - Use collected data to find probabilities and make predictions",
                "relationship": "Exact match"
            }
        ]
    },
    {
        "Standard ID": "7.SP.C.7",
        "Standard description": "Develop a probability model and use it to find probabilities of events. Compare probabilities from a model to observed frequencies; if the agreement is not good, explain possible sources of the discrepancy.",
        "Skill": [
            {
                "name": "Probability models",
                "description": "Construct and use probability models to determine the probabilities of events, and compare these to observed frequencies, identifying potential discrepancies.",
                "source": "Khan Academy Content - Probability models",
                "relationship": "Exact match"
            },
            {
                "name": "Simple probability",
                "description": "Calculate the probability of simple events from a given sample space.",
                "source": "Khan Academy Content - Simple probability",
                "relationship": "Exact match"
            },
            {
                "name": "List the sample space of a chance experiment and calculate probability when all outcomes are equally likely",
                "description": "Identify all possible outcomes in a sample space and calculate theoretical probabilities for equally likely events.",
                "source": "EngageNY Content - Lesson 3: What Are Probabilities?",
                "relationship": "Exact match"
            },
            {
                "name": "Simulate real-world situations with simple experiments to reflect event probabilities",
                "description": "Design and conduct simple simulations to model real-world chance events and estimate their probabilities.",
                "source": "EngageNY Content - Lesson 6: Estimating Probabilities Using Simulation",
                "relationship": "Exact match"
            },
            {
                "name": "Sample spaces of simple events",
                "description": "Identify all possible outcomes for simple chance events.",
                "source": "IXL Content - Sample spaces of simple events",
                "relationship": "Exact match"
            },
            {
                "name": "Probability of simple events",
                "description": "Calculate the probability of simple events.",
                "source": "IXL Content - Probability of simple events",
                "relationship": "Exact match"
            },
            {
                "name": "Make predictions using theoretical probability",
                "description": "Use theoretical probability to make predictions about the frequency of events.",
                "source": "IXL Content - Make predictions using theoretical probability",
                "relationship": "Exact match"
            }
        ]
    },
    {
        "Standard ID": "7.SP.C.7.a",
        "Standard description": "Develop a uniform probability model by assigning equal probability to all outcomes, and use the model to determine probabilities of events.",
        "Skill": [
            {
                "name": "Simple probability (uniform model)",
                "description": "Develop a uniform probability model by assigning equal probability to all outcomes and use it to find probabilities of events.",
                "source": "Khan Academy Content - Simple probability",
                "relationship": "Subset"
            }
        ]
    },
    {
        "Standard ID": "7.SP.C.7.b",
        "Standard description": "Develop a probability model (which may not be uniform) by observing frequencies in data generated from a chance process.",
        "Skill": [
            {
                "name": "Probability models (non-uniform from observed frequencies)",
                "description": "Develop a probability model (which may not be uniform) by observing and analyzing frequencies from data generated by a chance process.",
                "source": "Khan Academy Content - Probability models",
                "relationship": "Subset"
            },
            {
                "name": "Probability of simple events and opposite events",
                "description": "Calculate probabilities of simple events and their complements (opposite events).",
                "source": "IXL Content - Probability of simple events and opposite events",
                "relationship": "Exact match"
            },
            {
                "name": "Probability of mutually exclusive events and overlapping events",
                "description": "Distinguish between and calculate probabilities of mutually exclusive and overlapping events.",
                "source": "IXL Content - Probability of mutually exclusive events and overlapping events",
                "relationship": "Exact match"
            }
        ]
    },
    {
        "Standard ID": "7.SP.C.8",
        "Standard description": "Find probabilities of compound events using organized lists, tables, tree diagrams, and simulation.",
        "Skill": [
            {
                "name": "Probabilities of compound events",
                "description": "Calculate the probabilities of compound events using organized lists, tables, and tree diagrams.",
                "source": "Khan Academy Content - Probabilities of compound events",
                "relationship": "Exact match"
            },
            {
                "name": "Sample spaces for compound events",
                "description": "Construct and identify sample spaces for compound events using various methods (lists, tables, tree diagrams).",
                "source": "Khan Academy Content - Sample spaces for compound events",
                "relationship": "Exact match"
            },
            {
                "name": "The counting principle",
                "description": "Apply the fundamental counting principle to determine the total number of outcomes for compound events.",
                "source": "Khan Academy Content - The counting principle",
                "relationship": "Exact match"
            },
            {
                "name": "Use simulation to estimate the probability of multi-step events",
                "description": "Design and execute simulations to estimate probabilities of multi-step events.",
                "source": "EngageNY Content - Lesson 7: Simulating Multi-Step Experiments",
                "relationship": "Exact match"
            },
            {
                "name": "Find sample space using tables, trees, or organized lists, and determine total possible outcomes for compound events",
                "description": "Systematically list and determine all possible outcomes (sample space) for compound events using tables, tree diagrams, or organized lists.",
                "source": "EngageNY Content - Lesson 8: Keeping Track of All Possible Outcomes",
                "relationship": "Exact match"
            },
            {
                "name": "Use sample space to calculate the probability of an event in multi-step experiments",
                "description": "Calculate the probability of events in multi-step experiments by analyzing their sample spaces.",
                "source": "EngageNY Content - Lesson 9: Multi-Step Experiments",
                "relationship": "Exact match"
            },
            {
                "name": "Design and perform a multi-step simulation to estimate probability of a compound event",
                "description": "Plan and carry out multi-step simulations to approximate the probability of compound events.",
                "source": "EngageNY Content - Lesson 10: Designing Simulations",
                "relationship": "Exact match"
            },
            {
                "name": "Sample spaces for compound events",
                "description": "Identify all possible outcomes for compound chance events.",
                "source": "IXL Content - Sample spaces for compound events",
                "relationship": "Exact match"
            },
            {
                "name": "Compound events: find the number of outcomes",
                "description": "Determine the total number of possible outcomes for compound events.",
                "source": "IXL Content - Compound events: find the number of outcomes",
                "relationship": "Exact match"
            },
            {
                "name": "Compound events: find the number of sums",
                "description": "Determine the number of possible sums when combining outcomes from two events.",
                "source": "IXL Content - Compound events: find the number of sums",
                "relationship": "Exact match"
            },
            {
                "name": "Find the number of outcomes: word problems",
                "description": "Solve word problems that require finding the total number of outcomes for compound events.",
                "source": "IXL Content - Find the number of outcomes: word problems",
                "relationship": "Exact match"
            },
            {
                "name": "Probability of compound events",
                "description": "Calculate the probability of compound events.",
                "source": "IXL Content - Probability of compound events",
                "relationship": "Exact match"
            },
            {
                "name": "Which simulation represents the situation?",
                "description": "Identify appropriate simulations to model given real-world chance situations.",
                "source": "IXL Content - Which simulation represents the situation?",
                "relationship": "Exact match"
            },
            {
                "name": "Identify independent and dependent events",
                "description": "Distinguish between independent and dependent events.",
                "source": "IXL Content - Identify independent and dependent events",
                "relationship": "Exact match"
            },
            {
                "name": "Probability of independent and dependent events",
                "description": "Calculate probabilities of independent and dependent compound events.",
                "source": "IXL Content - Probability of independent and dependent events",
                "relationship": "Exact match"
            }
        ]
    },
    {
        "Standard ID": "7.SP.C.8.a",
        "Standard description": "Understand that, just as with simple events, the probability of a compound event is the fraction of outcomes in the sample space for which the compound event occurs.",
        "Skill": [
            {
                "name": "Understand probability of compound events as a fraction of sample space",
                "description": "Understand that the probability of a compound event is the ratio of favorable outcomes to the total outcomes in the sample space.",
                "source": "Khan Academy Content - Probabilities of compound events",
                "relationship": "Subset"
            }
        ]
    },
    {
        "Standard ID": "7.SP.C.8.b",
        "Standard description": "Represent sample spaces for compound events using methods such as organized lists, tables and tree diagrams. For an event described in everyday language (e.g., “rolling double sixes”), identify the outcomes in the sample space which compose the event.",
        "Skill": [
            {
                "name": "Represent sample spaces for compound events (lists, tables, trees)",
                "description": "Create organized lists, tables, and tree diagrams to represent the sample spaces for compound events.",
                "source": "Khan Academy Content - Sample spaces for compound events",
                "relationship": "Exact match"
            },
            {
                "name": "Identify outcomes for compound events described in everyday language",
                "description": "Given a compound event described verbally, identify all the specific outcomes in the sample space that constitute that event.",
                "source": "Khan Academy Content - Probabilities of compound events",
                "relationship": "Subset"
            }
        ]
    }
]